MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128h.h
extern volatile __ANSELFbits_t ANSELFbits __asm__ ("ANSELF") __attribute__((section("sfrs"), address(0xBF886500)));
extern volatile uint32_t        ANSELFCLR __attribute__((section("sfrs"),address(0xBF886504)));
extern volatile uint32_t        ANSELFSET __attribute__((section("sfrs"),address(0xBF886508)));
extern volatile uint32_t        ANSELFINV __attribute__((section("sfrs"),address(0xBF88650C)));
#define TRISF TRISF
extern volatile uint32_t   TRISF __attribute__((section("sfrs"), address(0xBF886510)));
typedef union {
  struct {
    uint32_t TRISF0:1;
    uint32_t TRISF1:1;
    uint32_t :1;
    uint32_t TRISF3:1;
    uint32_t TRISF4:1;
    uint32_t TRISF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISFbits_t;
extern volatile __TRISFbits_t TRISFbits __asm__ ("TRISF") __attribute__((section("sfrs"), address(0xBF886510)));
extern volatile uint32_t        TRISFCLR __attribute__((section("sfrs"),address(0xBF886514)));
extern volatile uint32_t        TRISFSET __attribute__((section("sfrs"),address(0xBF886518)));
extern volatile uint32_t        TRISFINV __attribute__((section("sfrs"),address(0xBF88651C)));
#define PORTF PORTF
extern volatile uint32_t   PORTF __attribute__((section("sfrs"), address(0xBF886520)));
typedef union {
  struct {
    uint32_t RF0:1;
    uint32_t RF1:1;
    uint32_t :1;
    uint32_t RF3:1;
    uint32_t RF4:1;
    uint32_t RF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTFbits_t;
extern volatile __PORTFbits_t PORTFbits __asm__ ("PORTF") __attribute__((section("sfrs"), address(0xBF886520)));
extern volatile uint32_t        PORTFCLR __attribute__((section("sfrs"),address(0xBF886524)));
extern volatile uint32_t        PORTFSET __attribute__((section("sfrs"),address(0xBF886528)));
extern volatile uint32_t        PORTFINV __attribute__((section("sfrs"),address(0xBF88652C)));
#define LATF LATF
extern volatile uint32_t   LATF __attribute__((section("sfrs"), address(0xBF886530)));
typedef union {
  struct {
    uint32_t LATF0:1;
    uint32_t LATF1:1;
    uint32_t :1;
    uint32_t LATF3:1;
    uint32_t LATF4:1;
    uint32_t LATF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits __asm__ ("LATF") __attribute__((section("sfrs"), address(0xBF886530)));
extern volatile uint32_t        LATFCLR __attribute__((section("sfrs"),address(0xBF886534)));
extern volatile uint32_t        LATFSET __attribute__((section("sfrs"),address(0xBF886538)));
extern volatile uint32_t        LATFINV __attribute__((section("sfrs"),address(0xBF88653C)));
#define ODCF ODCF
extern volatile uint32_t   ODCF __attribute__((section("sfrs"), address(0xBF886540)));
typedef union {
  struct {
    uint32_t ODCF0:1;
    uint32_t ODCF1:1;
    uint32_t :1;
    uint32_t ODCF3:1;
    uint32_t ODCF4:1;
    uint32_t ODCF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCFbits_t;
extern volatile __ODCFbits_t ODCFbits __asm__ ("ODCF") __attribute__((section("sfrs"), address(0xBF886540)));
extern volatile uint32_t        ODCFCLR __attribute__((section("sfrs"),address(0xBF886544)));
extern volatile uint32_t        ODCFSET __attribute__((section("sfrs"),address(0xBF886548)));
extern volatile uint32_t        ODCFINV __attribute__((section("sfrs"),address(0xBF88654C)));
#define CNPUF CNPUF
extern volatile uint32_t   CNPUF __attribute__((section("sfrs"), address(0xBF886550)));
typedef union {
  struct {
    uint32_t CNPUF0:1;
    uint32_t CNPUF1:1;
    uint32_t :1;
    uint32_t CNPUF3:1;
    uint32_t CNPUF4:1;
    uint32_t CNPUF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUFbits_t;
extern volatile __CNPUFbits_t CNPUFbits __asm__ ("CNPUF") __attribute__((section("sfrs"), address(0xBF886550)));
extern volatile uint32_t        CNPUFCLR __attribute__((section("sfrs"),address(0xBF886554)));
extern volatile uint32_t        CNPUFSET __attribute__((section("sfrs"),address(0xBF886558)));
extern volatile uint32_t        CNPUFINV __attribute__((section("sfrs"),address(0xBF88655C)));
#define CNPDF CNPDF
extern volatile uint32_t   CNPDF __attribute__((section("sfrs"), address(0xBF886560)));
typedef union {
  struct {
    uint32_t CNPDF0:1;
    uint32_t CNPDF1:1;
    uint32_t :1;
    uint32_t CNPDF3:1;
    uint32_t CNPDF4:1;
    uint32_t CNPDF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDFbits_t;
extern volatile __CNPDFbits_t CNPDFbits __asm__ ("CNPDF") __attribute__((section("sfrs"), address(0xBF886560)));
extern volatile uint32_t        CNPDFCLR __attribute__((section("sfrs"),address(0xBF886564)));
extern volatile uint32_t        CNPDFSET __attribute__((section("sfrs"),address(0xBF886568)));
extern volatile uint32_t        CNPDFINV __attribute__((section("sfrs"),address(0xBF88656C)));
#define CNCONF CNCONF
extern volatile uint32_t   CNCONF __attribute__((section("sfrs"), address(0xBF886570)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONFbits_t;
extern volatile __CNCONFbits_t CNCONFbits __asm__ ("CNCONF") __attribute__((section("sfrs"), address(0xBF886570)));
extern volatile uint32_t        CNCONFCLR __attribute__((section("sfrs"),address(0xBF886574)));
extern volatile uint32_t        CNCONFSET __attribute__((section("sfrs"),address(0xBF886578)));
extern volatile uint32_t        CNCONFINV __attribute__((section("sfrs"),address(0xBF88657C)));
#define CNENF CNENF
extern volatile uint32_t   CNENF __attribute__((section("sfrs"), address(0xBF886580)));
typedef union {
  struct {
    uint32_t CNIEF0:1;
    uint32_t CNIEF1:1;
    uint32_t :1;
    uint32_t CNIEF3:1;
    uint32_t CNIEF4:1;
    uint32_t CNIEF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENFbits_t;
extern volatile __CNENFbits_t CNENFbits __asm__ ("CNENF") __attribute__((section("sfrs"), address(0xBF886580)));
extern volatile uint32_t        CNENFCLR __attribute__((section("sfrs"),address(0xBF886584)));
extern volatile uint32_t        CNENFSET __attribute__((section("sfrs"),address(0xBF886588)));
extern volatile uint32_t        CNENFINV __attribute__((section("sfrs"),address(0xBF88658C)));
#define CNSTATF CNSTATF
extern volatile uint32_t   CNSTATF __attribute__((section("sfrs"), address(0xBF886590)));
typedef union {
  struct {
    uint32_t CNSTATF0:1;
    uint32_t CNSTATF1:1;
    uint32_t :1;
    uint32_t CNSTATF3:1;
    uint32_t CNSTATF4:1;
    uint32_t CNSTATF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATFbits_t;
extern volatile __CNSTATFbits_t CNSTATFbits __asm__ ("CNSTATF") __attribute__((section("sfrs"), address(0xBF886590)));
extern volatile uint32_t        CNSTATFCLR __attribute__((section("sfrs"),address(0xBF886594)));
extern volatile uint32_t        CNSTATFSET __attribute__((section("sfrs"),address(0xBF886598)));
extern volatile uint32_t        CNSTATFINV __attribute__((section("sfrs"),address(0xBF88659C)));
#define ANSELG ANSELG
extern volatile uint32_t   ANSELG __attribute__((section("sfrs"), address(0xBF886600)));
typedef union {
  struct {
    uint32_t :6;
    uint32_t ANSG6:1;
    uint32_t ANSG7:1;
    uint32_t ANSG8:1;
    uint32_t ANSG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELGbits_t;
extern volatile __ANSELGbits_t ANSELGbits __asm__ ("ANSELG") __attribute__((section("sfrs"), address(0xBF886600)));
extern volatile uint32_t        ANSELGCLR __attribute__((section("sfrs"),address(0xBF886604)));
extern volatile uint32_t        ANSELGSET __attribute__((section("sfrs"),address(0xBF886608)));
extern volatile uint32_t        ANSELGINV __attribute__((section("sfrs"),address(0xBF88660C)));
#define TRISG TRISG
extern volatile uint32_t   TRISG __attribute__((section("sfrs"), address(0xBF886610)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TRISG2:1;
    uint32_t TRISG3:1;
    uint32_t :2;
    uint32_t TRISG6:1;
    uint32_t TRISG7:1;
    uint32_t TRISG8:1;
    uint32_t TRISG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISGbits_t;
extern volatile __TRISGbits_t TRISGbits __asm__ ("TRISG") __attribute__((section("sfrs"), address(0xBF886610)));
extern volatile uint32_t        TRISGCLR __attribute__((section("sfrs"),address(0xBF886614)));
extern volatile uint32_t        TRISGSET __attribute__((section("sfrs"),address(0xBF886618)));
extern volatile uint32_t        TRISGINV __attribute__((section("sfrs"),address(0xBF88661C)));
#define PORTG PORTG
extern volatile uint32_t   PORTG __attribute__((section("sfrs"), address(0xBF886620)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RG2:1;
    uint32_t RG3:1;
    uint32_t :2;
    uint32_t RG6:1;
    uint32_t RG7:1;
    uint32_t RG8:1;
    uint32_t RG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTGbits_t;
extern volatile __PORTGbits_t PORTGbits __asm__ ("PORTG") __attribute__((section("sfrs"), address(0xBF886620)));
extern volatile uint32_t        PORTGCLR __attribute__((section("sfrs"),address(0xBF886624)));
extern volatile uint32_t        PORTGSET __attribute__((section("sfrs"),address(0xBF886628)));
extern volatile uint32_t        PORTGINV __attribute__((section("sfrs"),address(0xBF88662C)));
#define LATG LATG
extern volatile uint32_t   LATG __attribute__((section("sfrs"), address(0xBF886630)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t LATG2:1;
    uint32_t LATG3:1;
    uint32_t :2;
    uint32_t LATG6:1;
    uint32_t LATG7:1;
    uint32_t LATG8:1;
    uint32_t LATG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATGbits_t;
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF886630)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF886634)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF886638)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF88663C)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF886640)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t ODCG2:1;
    uint32_t ODCG3:1;
    uint32_t :2;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF886640)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF886644)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF886648)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF88664C)));
#define CNPUG CNPUG
extern volatile uint32_t   CNPUG __attribute__((section("sfrs"), address(0xBF886650)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t CNPUG2:1;
    uint32_t CNPUG3:1;
    uint32_t :2;
    uint32_t CNPUG6:1;
    uint32_t CNPUG7:1;
    uint32_t CNPUG8:1;
    uint32_t CNPUG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs"), address(0xBF886650)));
extern volatile uint32_t        CNPUGCLR __attribute__((section("sfrs"),address(0xBF886654)));
extern volatile uint32_t        CNPUGSET __attribute__((section("sfrs"),address(0xBF886658)));
extern volatile uint32_t        CNPUGINV __attribute__((section("sfrs"),address(0xBF88665C)));
#define CNPDG CNPDG
extern volatile uint32_t   CNPDG __attribute__((section("sfrs"), address(0xBF886660)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t CNPDG2:1;
    uint32_t CNPDG3:1;
    uint32_t :2;
    uint32_t CNPDG6:1;
    uint32_t CNPDG7:1;
    uint32_t CNPDG8:1;
    uint32_t CNPDG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs"), address(0xBF886660)));
extern volatile uint32_t        CNPDGCLR __attribute__((section("sfrs"),address(0xBF886664)));
extern volatile uint32_t        CNPDGSET __attribute__((section("sfrs"),address(0xBF886668)));
extern volatile uint32_t        CNPDGINV __attribute__((section("sfrs"),address(0xBF88666C)));
#define CNCONG CNCONG
extern volatile uint32_t   CNCONG __attribute__((section("sfrs"), address(0xBF886670)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs"), address(0xBF886670)));
extern volatile uint32_t        CNCONGCLR __attribute__((section("sfrs"),address(0xBF886674)));
extern volatile uint32_t        CNCONGSET __attribute__((section("sfrs"),address(0xBF886678)));
extern volatile uint32_t        CNCONGINV __attribute__((section("sfrs"),address(0xBF88667C)));
#define CNENG CNENG
extern volatile uint32_t   CNENG __attribute__((section("sfrs"), address(0xBF886680)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t CNIEG2:1;
    uint32_t CNIEG3:1;
    uint32_t :2;
    uint32_t CNIEG6:1;
    uint32_t CNIEG7:1;
    uint32_t CNIEG8:1;
    uint32_t CNIEG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF886680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF886684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF886688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF88668C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF886690)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t CNSTATG2:1;
    uint32_t CNSTATG3:1;
    uint32_t :2;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF886690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF886694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF886698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF88669C)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF88B000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs"), address(0xBF88B000)));
extern volatile uint32_t        C1CONCLR __attribute__((section("sfrs"),address(0xBF88B004)));
extern volatile uint32_t        C1CONSET __attribute__((section("sfrs"),address(0xBF88B008)));
extern volatile uint32_t        C1CONINV __attribute__((section("sfrs"),address(0xBF88B00C)));
#define C1CFG C1CFG
extern volatile uint32_t   C1CFG __attribute__((section("sfrs"), address(0xBF88B010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CFGbits_t;
