MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128h.h
#define _C1FIFOINT31_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT31_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT31_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT31_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT31_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT31_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT31_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT31_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT31_TXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT31_TXNFULLIF_POSITION          0x0000000A
#define _C1FIFOINT31_TXNFULLIF_MASK              0x00000400
#define _C1FIFOINT31_TXNFULLIF_LENGTH            0x00000001

#define _C1FIFOINT31_RXNEMPTYIE_POSITION         0x00000010
#define _C1FIFOINT31_RXNEMPTYIE_MASK             0x00010000
#define _C1FIFOINT31_RXNEMPTYIE_LENGTH           0x00000001

#define _C1FIFOINT31_RXHALFIE_POSITION           0x00000011
#define _C1FIFOINT31_RXHALFIE_MASK               0x00020000
#define _C1FIFOINT31_RXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT31_RXFULLIE_POSITION           0x00000012
#define _C1FIFOINT31_RXFULLIE_MASK               0x00040000
#define _C1FIFOINT31_RXFULLIE_LENGTH             0x00000001

#define _C1FIFOINT31_RXOVFLIE_POSITION           0x00000013
#define _C1FIFOINT31_RXOVFLIE_MASK               0x00080000
#define _C1FIFOINT31_RXOVFLIE_LENGTH             0x00000001

#define _C1FIFOINT31_TXEMPTYIE_POSITION          0x00000018
#define _C1FIFOINT31_TXEMPTYIE_MASK              0x01000000
#define _C1FIFOINT31_TXEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT31_TXHALFIE_POSITION           0x00000019
#define _C1FIFOINT31_TXHALFIE_MASK               0x02000000
#define _C1FIFOINT31_TXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT31_TXNFULLIE_POSITION          0x0000001A
#define _C1FIFOINT31_TXNFULLIE_MASK              0x04000000
#define _C1FIFOINT31_TXNFULLIE_LENGTH            0x00000001

#define _C1FIFOINT31_w_POSITION                  0x00000000
#define _C1FIFOINT31_w_MASK                      0xFFFFFFFF
#define _C1FIFOINT31_w_LENGTH                    0x00000020

#define _C1FIFOCI31_CFIFOCI_POSITION             0x00000000
#define _C1FIFOCI31_CFIFOCI_MASK                 0x0000001F
#define _C1FIFOCI31_CFIFOCI_LENGTH               0x00000005

#define _C1FIFOCI31_w_POSITION                   0x00000000
#define _C1FIFOCI31_w_MASK                       0xFFFFFFFF
#define _C1FIFOCI31_w_LENGTH                     0x00000020

#define _DEVCFG3_USERID_POSITION                 0x00000000
#define _DEVCFG3_USERID_MASK                     0x0000FFFF
#define _DEVCFG3_USERID_LENGTH                   0x00000010

#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

#define _DEVCFG3_IOL1WAY_POSITION                0x0000001D
#define _DEVCFG3_IOL1WAY_MASK                    0x20000000
#define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_FUSBIDIO_POSITION               0x0000001E
#define _DEVCFG3_FUSBIDIO_MASK                   0x40000000
#define _DEVCFG3_FUSBIDIO_LENGTH                 0x00000001

#define _DEVCFG3_FVBUSONIO_POSITION              0x0000001F
#define _DEVCFG3_FVBUSONIO_MASK                  0x80000000
#define _DEVCFG3_FVBUSONIO_LENGTH                0x00000001

#define _DEVCFG3_w_POSITION                      0x00000000
#define _DEVCFG3_w_MASK                          0xFFFFFFFF
#define _DEVCFG3_w_LENGTH                        0x00000020

#define _DEVCFG2_FPLLIDIV_POSITION               0x00000000
#define _DEVCFG2_FPLLIDIV_MASK                   0x00000007
#define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003

#define _DEVCFG2_FPLLMUL_POSITION                0x00000004
#define _DEVCFG2_FPLLMUL_MASK                    0x00000070
#define _DEVCFG2_FPLLMUL_LENGTH                  0x00000003

#define _DEVCFG2_UPLLIDIV_POSITION               0x00000008
#define _DEVCFG2_UPLLIDIV_MASK                   0x00000700
#define _DEVCFG2_UPLLIDIV_LENGTH                 0x00000003

#define _DEVCFG2_UPLLEN_POSITION                 0x0000000F
#define _DEVCFG2_UPLLEN_MASK                     0x00008000
#define _DEVCFG2_UPLLEN_LENGTH                   0x00000001

#define _DEVCFG2_FPLLODIV_POSITION               0x00000010
#define _DEVCFG2_FPLLODIV_MASK                   0x00070000
#define _DEVCFG2_FPLLODIV_LENGTH                 0x00000003

#define _DEVCFG2_w_POSITION                      0x00000000
#define _DEVCFG2_w_MASK                          0xFFFFFFFF
#define _DEVCFG2_w_LENGTH                        0x00000020

#define _DEVCFG1_FNOSC_POSITION                  0x00000000
#define _DEVCFG1_FNOSC_MASK                      0x00000007
#define _DEVCFG1_FNOSC_LENGTH                    0x00000003

#define _DEVCFG1_FSOSCEN_POSITION                0x00000005
#define _DEVCFG1_FSOSCEN_MASK                    0x00000020
#define _DEVCFG1_FSOSCEN_LENGTH                  0x00000001

#define _DEVCFG1_IESO_POSITION                   0x00000007
#define _DEVCFG1_IESO_MASK                       0x00000080
#define _DEVCFG1_IESO_LENGTH                     0x00000001

#define _DEVCFG1_POSCMOD_POSITION                0x00000008
#define _DEVCFG1_POSCMOD_MASK                    0x00000300
#define _DEVCFG1_POSCMOD_LENGTH                  0x00000002

#define _DEVCFG1_OSCIOFNC_POSITION               0x0000000A
#define _DEVCFG1_OSCIOFNC_MASK                   0x00000400
#define _DEVCFG1_OSCIOFNC_LENGTH                 0x00000001

#define _DEVCFG1_FPBDIV_POSITION                 0x0000000C
#define _DEVCFG1_FPBDIV_MASK                     0x00003000
#define _DEVCFG1_FPBDIV_LENGTH                   0x00000002

#define _DEVCFG1_FCKSM_POSITION                  0x0000000E
#define _DEVCFG1_FCKSM_MASK                      0x0000C000
#define _DEVCFG1_FCKSM_LENGTH                    0x00000002

#define _DEVCFG1_WDTPS_POSITION                  0x00000010
#define _DEVCFG1_WDTPS_MASK                      0x001F0000
#define _DEVCFG1_WDTPS_LENGTH                    0x00000005

#define _DEVCFG1_WINDIS_POSITION                 0x00000016
#define _DEVCFG1_WINDIS_MASK                     0x00400000
#define _DEVCFG1_WINDIS_LENGTH                   0x00000001

#define _DEVCFG1_FWDTEN_POSITION                 0x00000017
#define _DEVCFG1_FWDTEN_MASK                     0x00800000
#define _DEVCFG1_FWDTEN_LENGTH                   0x00000001

